Revit 2027 API
RebarBendData(RebarBarType, RebarStyle, BarTerminationsData) Constructor
 Constructs a new RebarBendData using the bar type, style and termination's values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarBendData(
	RebarBarType barType,
	RebarStyle style,
	BarTerminationsData barTerminationsData
)
Public Sub New (
	barType As RebarBarType,
	style As RebarStyle,
	barTerminationsData As BarTerminationsData
)
public:
RebarBendData(
	RebarBarType^ barType,
	RebarStyle style,
	BarTerminationsData^ barTerminationsData
)
new :
        barType : RebarBarType *
        style : RebarStyle *
        barTerminationsData : BarTerminationsData -> RebarBendData
Parameters
barType RebarBarType
 The RebarBarType.
style RebarStyle
 The style.
barTerminationsData BarTerminationsData
 The bar terminaions data.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendData Class
RebarBendData Overload
Autodesk.Revit.DB.Structure Namespace